<template>
  <v-dialog v-model="dialog"
            fullscreen
            hide-overlay
            transition="dialog-bottom-transition"
  >
    <v-toolbar dark color="secondary">
      <v-toolbar-title>How it works</v-toolbar-title>
      <v-spacer></v-spacer>
        <v-toolbar-items>
          <v-btn dark text @click="$emit('update:dialog', false)">Close</v-btn>
        </v-toolbar-items>
    </v-toolbar>
    <v-card class="pa-4">
      <v-card-title><h3>Important notes</h3></v-card-title>
        <v-card-text class='pa-4'>
        <p>При выборе любого из режимов (добавление, редактирование, удаление) остальные режимы будут недоступны, пока не завершится текущее действие!</p>
        <p class="mb-8">Также кнопка "APPLY CHANGES" не будет активна, если не было произведено никаких изменений (состояние данных на сервере соответсвует текущему, отрисованному на карте).</p>
        <ol>
          <li class="mb-8">
            <h3 class="mb-2">Adding polygon</h3>
            <p>Нажмите кнопку "ACTIVATE ADD MODE".</p>
            <p>Появятся два радиобаттона "Service available" и "Build commenced", также появится окно с выбором инструмента для рисования (левый нижний угол карты).</p>
            <p>Отметьте нужный радиобаттон, выберите инструмент рисования полигонов (значок полигона справа от значка руки). При наведении на карту курсор должен поменять свой вид на перекрестие.</p>
            <p>Далее начните рисование (клик левой кнопкой мыши поставит вершину полигона).<b> Обратите внимание, что полигон должен быть замкнутым,</b> об этом будет свидетельствовать появление зеленого цвета заливки полигона.</p>
            <p>Когда полигон был успешно отрисован, нажмите кнопку "ADD POLYGON". Кнопка будет доступна только в случае если полигон замкнут и отмечен один из чекбоксов с типом полигона ("Service Available" or "Build Commenced").</p>
            <p><b class="mb-5">После отрисовки полигона обязательно нажмите кнопку "ADD POLYGON", и только потом переходите к рисованию следующего!</b></p>
            <p>После нажатия кнопки "ADD POLYGON" добавленный полигон поменяет цвет заливки на цвет соответсвующий его типу.</p>
            <p>Для выхода из режима редактирования нажмите кнопку "DEACTIVATE ADD MODE". После нажатия обратите внимание, что кнопка "APPLY CHANGES" стала доступна для нажатия</p>
          </li>
          <li class="mb-8">
            <h3 class="mb-2">Deleting polygon</h3>
            <p>Поставьте галочку "Activate delete mode".</p>
            <p>Нажамите на полигоне который хотите удалить левой кнопкой мыши, цвет заливки полигона станет красным.</p>
            <p>Если полигон был выбран для удаления по ошибке, нажатие на нем правой кнопкой мыши позволит отменить выделение.</p>
            <p>После того как полигон выбран нажмите кнопку "DELETE POLYGON", и выбранный полигон перестанет отображаться на карте.</p>
            <p><b>Также обратите внимание</b>, что для удаления можно выбрать только один полигон одновременно.</p>
            <p><b>После выбора полигона обязательно нажмите кнопку "DELETE POLYGON", и только потом переходите к выбору следующего!</b></p>
            <p>Обратите внимание, что кнопка "APPLY CHANGES" стала доступна для нажатия</p>
          </li>
          <li class="mb-8">
            <h3 class="mb-2">Applying changes</h3>
            <p>После того, как были сделаны все необходимые изменения, кнопка "APPLY CHANGES" станет доступной для нажатия.</p>
            <p><b>Обратите внимание</b>, что кнопка "APPLY CHANGES" активна только в случае, когда не активны режимы редактирования и были внесены какие-то изменения в геометрию полигонов.</p>
            <p><b>При нажатии "APPLY CHANGES" внесенные изменения будут отправленны на сервер</b></p>
            <p>Процесс отправки данных занимает какое-то время, на время загрузки поле карты будет недоступно.</p>
            <p>После успешной отправки данных будет снова отображена карта с актуальной версией полигонов с сервера.</p>
          </li>
        </ol>
      </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  name: 'InstructionForPolygons',
  props: {
    dialog: Boolean,
  },
  data: () => ({
    //
  }),
}
</script>
