<template>
  <v-dialog v-model="dialog"
            fullscreen
            hide-overlay
            transition="dialog-bottom-transition"
  >
    <v-toolbar dark color="secondary">
      <v-toolbar-title>How it works</v-toolbar-title>
      <v-spacer></v-spacer>
        <v-toolbar-items>
          <v-btn dark text @click="$emit('update:dialog', false)">Close</v-btn>
        </v-toolbar-items>
    </v-toolbar>
    <v-card class="pa-4">
      <v-card-title><h3>Important notes</h3></v-card-title>
        <v-card-text class='pa-4'>
        <p>При выборе одного из режимов (добавление, удаление) оставшийся режим будут недоступен, пока не завершится текущее действие!</p>
        <p class="mb-8">Также кнопка "APPLY CHANGES" не будет активна, если не было произведено никаких изменений (состояние данных на сервере соответсвует текущему, отрисованному на карте).</p>
        <ol>
          <li class="mb-8">
            <h3 class="mb-2">Adding marker</h3>
            <p>Нажмите кнопку "ACTIVATE ADD MODE".</p>
            <p>Строка ввода данных "Address", кнопка "SEARCH" и кнопка "ADD MARKER" станут активными. Также появится окно с выбором инструмента для рисования (левый нижний угол карты).</p>
            <p>Выберите инструмент с иконкой маркера, при наведении на карту курсор поменяет свой вид на перекрестие. Левой конпкой мыши добавьте маркер на нужное место на карте.</p>
            <p>Далее нажмите кнопку "ADD MARKER", чтобы применить изменения.</p>
            <p>Добавлять маркеры можно также с помощью строки ввода данных "Address" - начните вводить нужный адрес, далее выберите подходящий з предложенного в выпадающем списке, либо нажмите кнопку "SEARCH" - на карте появится маркер, соответствующий введенному адресу.</p>
            <p><b class="mb-5">После добавления маркера обязательно нажмите кнопку "ADD MARKER", и только потом переходите к добавлению следующего!</b></p>
            <p>Для выхода из режима добавления нажмите кнопку "DEACTIVATE ADD MODE". После нажатия обратите внимание, что кнопка "APPLY CHANGES" стала доступна для нажатия</p>
          </li>
          <li class="mb-8">
            <h3 class="mb-2">Deleting marker</h3>
            <p>Нажмите кнопку "ACTIVATE DELETE MODE".</p>
            <p>Нажамите на маркере который хотите удалить <b>правой кнопкой мыши</b>, выбранный маркер начнет прыгать.</p>
            <p>После того как маркер выбран нажмите кнопку "DELETE MARKER", и выбранный маркер перестанет отображаться на карте.</p>
            <p><b>Также обратите внимание</b>, что для удаления можно выбрать только один маркер одновременно.</p>
            <p><b>После выбора маркера обязательно нажмите кнопку "DELETE MARKER", и только потом переходите к выбору следующего!</b></p>
            <p>Для выхода из режима удаления нажмите кнопку "DEACTIVATE DELETE MODE". После нажатия обратите внимание, что кнопка "APPLY CHANGES" стала доступна для нажатия</p>
          </li>
          <li class="mb-8">
            <h3 class="mb-2">Applying changes</h3>
            <p>После того, как были сделаны все необходимые изменения, кнопка "APPLY CHANGES" станет доступной для нажатия.</p>
            <p><b>Обратите внимание</b>, что кнопка "APPLY CHANGES" активна только в случае, когда не активны режимы редактирования и были внесены какие-то изменения в геометрию маркеров.</p>
            <p><b>При нажатии "APPLY CHANGES" внесенные изменения будут отправленны на сервер</b></p>
            <p>Процесс отправки данных занимает какое-то время, на время загрузки поле карты будет недоступно.</p>
            <p>После успешной отправки данных будет снова отображена карта с актуальной версией маркеров с сервера.</p>
          </li>
        </ol>
      </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  name: 'InstructionForPolygons',
  props: {
    dialog: Boolean,
  },
  data: () => ({
    //
  }),
}
</script>
